In [1]:
import pandas as pd

In [3]:
df = pd.read_excel('test.xlsx')

In [4]:
df.head()

         day      city  temperature  windspeed  event
0 2017-01-01  new york           32          6   rain
1 2017-02-01  new york           36          7  sunny
2 2017-03-01  new york           28         12   snow
3 2017-04-01  new york           33          7  sunny
4 2017-01-01    mumbai           90          5  sunny

In [5]:
df.groupby('city')['temperature'].count()

city
mumbai      4
new york    4
paris       4
Name: temperature, dtype: int64

In [6]:
g = df.groupby('city')

In [7]:
g

In [8]:
g.head()

          day      city  temperature  windspeed   event
0  2017-01-01  new york           32          6    rain
1  2017-02-01  new york           36          7   sunny
2  2017-03-01  new york           28         12    snow
3  2017-04-01  new york           33          7   sunny
4  2017-01-01    mumbai           90          5   sunny
5  2017-02-01    mumbai           85         12     fog
6  2017-03-01    mumbai           87         15     fog
7  2017-04-01    mumbai           92          5    rain
8  2017-01-01     paris           45         20   sunny
9  2017-02-01     paris           50         13  cloudy
10 2017-03-01     paris           54          8  cloudy
11 2017-04-01     paris           42         10  cloudy

In [9]:
for city, city_df in g:
    print(city)
    print(city_df)

mumbai
         day    city  temperature  windspeed  event
4 2017-01-01  mumbai           90          5  sunny
5 2017-02-01  mumbai           85         12    fog
6 2017-03-01  mumbai           87         15    fog
7 2017-04-01  mumbai           92          5   rain
new york
         day      city  temperature  windspeed  event
0 2017-01-01  new york           32          6   rain
1 2017-02-01  new york           36          7  sunny
2 2017-03-01  new york           28         12   snow
3 2017-04-01  new york           33          7  sunny
paris
          day   city  temperature  windspeed   event
8  2017-01-01  paris           45         20   sunny
9  2017-02-01  paris           50         13  cloudy
10 2017-03-01  paris           54          8  cloudy
11 2017-04-01  paris           42         10  cloudy

In [11]:
g.get_group('new york')

         day      city  temperature  windspeed  event
0 2017-01-01  new york           32          6   rain
1 2017-02-01  new york           36          7  sunny
2 2017-03-01  new york           28         12   snow
3 2017-04-01  new york           33          7  sunny

In [13]:
g.max()

                day  temperature  windspeed  event
city
mumbai   2017-04-01           92         15  sunny
new york 2017-04-01           36         12  sunny
paris    2017-04-01           54         20  sunny

In [14]:
g.min()

                day  temperature  windspeed   event
city
mumbai   2017-01-01           85          5     fog
new york 2017-01-01           28          6    rain
paris    2017-01-01           42          8  cloudy

In [15]:
g.mean()

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [16]:
g.describe()

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0